2rtfm/stm8s103-sdcc-xmake/lib/spl_split/inc/inline/stm8s_tim2_inline.h
#ifndef __STM8S_TIM2_INLINE_H
#define __STM8S_TIM2_INLINE_H

#include "stm8s_tim2.h"

/** @addtogroup STM8S_StdPeriph_Driver
 * @{
 */
/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private function prototypes -----------------------------------------------*/
inline void TIM2_TI1_Config_inline(uint8_t TIM2_ICPolarity,
                                   uint8_t TIM2_ICSelection,
                                   uint8_t TIM2_ICFilter);
inline void TIM2_TI2_Config_inline(uint8_t TIM2_ICPolarity,
                                   uint8_t TIM2_ICSelection,
                                   uint8_t TIM2_ICFilter);
inline void TIM2_TI3_Config_inline(uint8_t TIM2_ICPolarity,
                                   uint8_t TIM2_ICSelection,
                                   uint8_t TIM2_ICFilter);
/**
 * @addtogroup TIM2_Public_Functions
 * @{
 */

/**
 * @brief  Deinitializes the TIM2 peripheral registers to their default reset
 * values.
 * @param  None
 * @retval None
 */
inline void TIM2_DeInit_inline(void) {
  TIM2->CR1 = (uint8_t)TIM2_CR1_RESET_VALUE;
  TIM2->IER = (uint8_t)TIM2_IER_RESET_VALUE;
  TIM2->SR2 = (uint8_t)TIM2_SR2_RESET_VALUE;

  /* Disable channels */
  TIM2->CCER1 = (uint8_t)TIM2_CCER1_RESET_VALUE;
  TIM2->CCER2 = (uint8_t)TIM2_CCER2_RESET_VALUE;

  /* Then reset channel registers: it also works if lock level is equal to 2 or
   * 3 */
  TIM2->CCER1 = (uint8_t)TIM2_CCER1_RESET_VALUE;
  TIM2->CCER2 = (uint8_t)TIM2_CCER2_RESET_VALUE;
  TIM2->CCMR1 = (uint8_t)TIM2_CCMR1_RESET_VALUE;
  TIM2->CCMR2 = (uint8_t)TIM2_CCMR2_RESET_VALUE;
  TIM2->CCMR3 = (uint8_t)TIM2_CCMR3_RESET_VALUE;
  TIM2->CNTRH = (uint8_t)TIM2_CNTRH_RESET_VALUE;
  TIM2->CNTRL = (uint8_t)TIM2_CNTRL_RESET_VALUE;
  TIM2->PSCR = (uint8_t)TIM2_PSCR_RESET_VALUE;
  TIM2->ARRH = (uint8_t)TIM2_ARRH_RESET_VALUE;
  TIM2->ARRL = (uint8_t)TIM2_ARRL_RESET_VALUE;
  TIM2->CCR1H = (uint8_t)TIM2_CCR1H_RESET_VALUE;
  TIM2->CCR1L = (uint8_t)TIM2_CCR1L_RESET_VALUE;
  TIM2->CCR2H = (uint8_t)TIM2_CCR2H_RESET_VALUE;
  TIM2->CCR2L = (uint8_t)TIM2_CCR2L_RESET_VALUE;
  TIM2->CCR3H = (uint8_t)TIM2_CCR3H_RESET_VALUE;
  TIM2->CCR3L = (uint8_t)TIM2_CCR3L_RESET_VALUE;
  TIM2->SR1 = (uint8_t)TIM2_SR1_RESET_VALUE;
}

/**
 * @brief  Initializes the TIM2 Time Base Unit according to the specified
 * parameters.
 * @param    TIM2_Prescaler specifies the Prescaler from TIM2_Prescaler_TypeDef.
 * @param    TIM2_Period specifies the Period value.
 * @retval None
 */
inline void TIM2_TimeBaseInit_inline(TIM2_Prescaler_TypeDef TIM2_Prescaler,
                                     uint16_t TIM2_Period) {
  /* Set the Prescaler value */
  TIM2->PSCR = (uint8_t)(TIM2_Prescaler);
  /* Set the Autoreload value */
  TIM2->ARRH = (uint8_t)(TIM2_Period >> 8);
  TIM2->ARRL = (uint8_t)(TIM2_Period);
}

/**
 * @brief  Initializes the TIM2 Channel1 according to the specified parameters.
 * @param   TIM2_OCMode specifies the Output Compare mode  from @ref
 * TIM2_OCMode_TypeDef.
 * @param   TIM2_OutputState specifies the Output State  from @ref
 * TIM2_OutputState_TypeDef.
 * @param   TIM2_Pulse specifies the Pulse width  value.
 * @param   TIM2_OCPolarity specifies the Output Compare Polarity  from @ref
 * TIM2_OCPolarity_TypeDef.
 * @retval None
 */
inline void TIM2_OC1Init_inline(TIM2_OCMode_TypeDef TIM2_OCMode,
                                TIM2_OutputState_TypeDef TIM2_OutputState,
                                uint16_t TIM2_Pulse,
                                TIM2_OCPolarity_TypeDef TIM2_OCPolarity) {
  /* Check the parameters */
  assert_param(IS_TIM2_OC_MODE_OK(TIM2_OCMode));
  assert_param(IS_TIM2_OUTPUT_STATE_OK(TIM2_OutputState));
  assert_param(IS_TIM2_OC_POLARITY_OK(TIM2_OCPolarity));

  /* Disable the Channel 1: Reset the CCE Bit, Set the Output State , the Output
   * Polarity */
  TIM2->CCER1 &= (uint8_t)(~(TIM2_CCER1_CC1E | TIM2_CCER1_CC1P));
  /* Set the Output State &  Set the Output Polarity  */
  TIM2->CCER1 |= (uint8_t)((uint8_t)(TIM2_OutputState & TIM2_CCER1_CC1E) |
                           (uint8_t)(TIM2_OCPolarity & TIM2_CCER1_CC1P));

  /* Reset the Output Compare Bits  & Set the Ouput Compare Mode */
  TIM2->CCMR1 = (uint8_t)((uint8_t)(TIM2->CCMR1 & (uint8_t)(~TIM2_CCMR_OCM)) |
                          (uint8_t)TIM2_OCMode);

  /* Set the Pulse value */
  TIM2->CCR1H = (uint8_t)(TIM2_Pulse >> 8);
  TIM2->CCR1L = (uint8_t)(TIM2_Pulse);
}

/**
 * @brief  Initializes the TIM2 Channel2 according to the specified parameters.
 * @param   TIM2_OCMode specifies the Output Compare mode  from @ref
 * TIM2_OCMode_TypeDef.
 * @param   TIM2_OutputState specifies the Output State  from @ref
 * TIM2_OutputState_TypeDef.
 * @param   TIM2_Pulse specifies the Pulse width  value.
 * @param   TIM2_OCPolarity specifies the Output Compare Polarity  from @ref
 * TIM2_OCPolarity_TypeDef.
 * @retval None
 */
inline void TIM2_OC2Init_inline(TIM2_OCMode_TypeDef TIM2_OCMode,
                                TIM2_OutputState_TypeDef TIM2_OutputState,
                                uint16_t TIM2_Pulse,
                                TIM2_OCPolarity_TypeDef TIM2_OCPolarity) {
  /* Check the parameters */
  assert_param(IS_TIM2_OC_MODE_OK(TIM2_OCMode));
  assert_param(IS_TIM2_OUTPUT_STATE_OK(TIM2_OutputState));
  assert_param(IS_TIM2_OC_POLARITY_OK(TIM2_OCPolarity));

  /* Disable the Channel 1: Reset the CCE Bit, Set the Output State, the Output
   * Polarity */
  TIM2->CCER1 &= (uint8_t)(~(TIM2_CCER1_CC2E | TIM2_CCER1_CC2P));
  /* Set the Output State & Set the Output Polarity */
  TIM2->CCER1 |= (uint8_t)((uint8_t)(TIM2_OutputState & TIM2_CCER1_CC2E) |
                           (uint8_t)(TIM2_OCPolarity & TIM2_CCER1_CC2P));

  /* Reset the Output Compare Bits & Set the Output Compare Mode */
  TIM2->CCMR2 = (uint8_t)((uint8_t)(TIM2->CCMR2 & (uint8_t)(~TIM2_CCMR_OCM)) |
                          (uint8_t)TIM2_OCMode);

  /* Set the Pulse value */
  TIM2->CCR2H = (uint8_t)(TIM2_Pulse >> 8);
  TIM2->CCR2L = (uint8_t)(TIM2_Pulse);
}

/**
 * @brief  Initializes the TIM2 Channel3 according to the specified parameters.
 * @param   TIM2_OCMode specifies the Output Compare mode from @ref
 * TIM2_OCMode_TypeDef.
 * @param   TIM2_OutputState specifies the Output State from @ref
 * TIM2_OutputState_TypeDef.
 * @param   TIM2_Pulse specifies the Pulse width value.
 * @param   TIM2_OCPolarity specifies the Output Compare Polarity  from @ref
 * TIM2_OCPolarity_TypeDef.
 * @retval None
 */
inline void TIM2_OC3Init_inline(TIM2_OCMode_TypeDef TIM2_OCMode,
                                TIM2_OutputState_TypeDef TIM2_OutputState,
                                uint16_t TIM2_Pulse,
                                TIM2_OCPolarity_TypeDef TIM2_OCPolarity) {
  /* Check the parameters */
  assert_param(IS_TIM2_OC_MODE_OK(TIM2_OCMode));
  assert_param(IS_TIM2_OUTPUT_STATE_OK(TIM2_OutputState));
  assert_param(IS_TIM2_OC_POLARITY_OK(TIM2_OCPolarity));
  /* Disable the Channel 1: Reset the CCE Bit, Set the Output State, the Output
   * Polarity */
  TIM2->CCER2 &= (uint8_t)(~(TIM2_CCER2_CC3E | TIM2_CCER2_CC3P));
  /* Set the Output State & Set the Output Polarity */
  TIM2->CCER2 |= (uint8_t)((uint8_t)(TIM2_OutputState & TIM2_CCER2_CC3E) |
                           (uint8_t)(TIM2_OCPolarity & TIM2_CCER2_CC3P));

