2rtfm/stm8s103-sdcc-xmake/lib/spl_split/inc/inline/stm8s_tim2_inline.h
  /* Reset the Output Compare Bits & Set the Output Compare Mode */
  TIM2->CCMR3 = (uint8_t)((uint8_t)(TIM2->CCMR3 & (uint8_t)(~TIM2_CCMR_OCM)) |
                          (uint8_t)TIM2_OCMode);

  /* Set the Pulse value */
  TIM2->CCR3H = (uint8_t)(TIM2_Pulse >> 8);
  TIM2->CCR3L = (uint8_t)(TIM2_Pulse);
}

inline void TIM2_SetIC1Prescaler_inline(TIM2_ICPSC_TypeDef TIM2_IC1Prescaler);
inline void TIM2_SetIC2Prescaler_inline(TIM2_ICPSC_TypeDef TIM2_IC2Prescaler);
inline void TIM2_SetIC3Prescaler_inline(TIM2_ICPSC_TypeDef TIM2_IC3Prescaler);

/**
 * @brief  Initializes the TIM2 peripheral according to the specified
 * parameters.
 * @param    TIM2_Channel specifies the Input Capture Channel from @ref
 * TIM2_Channel_TypeDef.
 * @param   TIM2_ICPolarity specifies the Input Capture Polarity from @ref
 * TIM2_ICPolarity_TypeDef.
 * @param   TIM2_ICSelection specifies the Input Capture Selection from @ref
 * TIM2_ICSelection_TypeDef.
 * @param   TIM2_ICPrescaler specifies the Input Capture Prescaler from @ref
 * TIM2_ICPSC_TypeDef.
 * @param   TIM2_ICFilter specifies the Input Capture Filter value (value can be
 * an integer from 0x00 to 0x0F).
 * @retval None
 */
inline void TIM2_ICInit_inline(TIM2_Channel_TypeDef TIM2_Channel,
                               TIM2_ICPolarity_TypeDef TIM2_ICPolarity,
                               TIM2_ICSelection_TypeDef TIM2_ICSelection,
                               TIM2_ICPSC_TypeDef TIM2_ICPrescaler,
                               uint8_t TIM2_ICFilter) {
  /* Check the parameters */
  assert_param(IS_TIM2_CHANNEL_OK(TIM2_Channel));
  assert_param(IS_TIM2_IC_POLARITY_OK(TIM2_ICPolarity));
  assert_param(IS_TIM2_IC_SELECTION_OK(TIM2_ICSelection));
  assert_param(IS_TIM2_IC_PRESCALER_OK(TIM2_ICPrescaler));
  assert_param(IS_TIM2_IC_FILTER_OK(TIM2_ICFilter));

  if (TIM2_Channel == TIM2_CHANNEL_1) {
    /* TI1 Configuration */
    TIM2_TI1_Config_inline((uint8_t)TIM2_ICPolarity, (uint8_t)TIM2_ICSelection,
                           (uint8_t)TIM2_ICFilter);

    /* Set the Input Capture Prescaler value */
    TIM2_SetIC1Prescaler_inline(TIM2_ICPrescaler);
  } else if (TIM2_Channel == TIM2_CHANNEL_2) {
    /* TI2 Configuration */
    TIM2_TI2_Config_inline((uint8_t)TIM2_ICPolarity, (uint8_t)TIM2_ICSelection,
                           (uint8_t)TIM2_ICFilter);

    /* Set the Input Capture Prescaler value */
    TIM2_SetIC2Prescaler_inline(TIM2_ICPrescaler);
  } else {
    /* TI3 Configuration */
    TIM2_TI3_Config_inline((uint8_t)TIM2_ICPolarity, (uint8_t)TIM2_ICSelection,
                           (uint8_t)TIM2_ICFilter);

    /* Set the Input Capture Prescaler value */
    TIM2_SetIC3Prescaler_inline(TIM2_ICPrescaler);
  }
}

/**
 * @brief  Configures the TIM2 peripheral in PWM Input Mode according to the
 * specified parameters.
 * @param    TIM2_Channel specifies the Input Capture Channel from @ref
 * TIM2_Channel_TypeDef.
 * @param   TIM2_ICPolarity specifies the Input Capture Polarity from @ref
 * TIM2_ICPolarity_TypeDef.
 * @param   TIM2_ICSelection specifies the Input Capture Selection from @ref
 * TIM2_ICSelection_TypeDef.
 * @param   TIM2_ICPrescaler specifies the Input Capture Prescaler from @ref
 * TIM2_ICPSC_TypeDef.
 * @param   TIM2_ICFilter specifies the Input Capture Filter value (value can be
 * an integer from 0x00 to 0x0F).
 * @retval None
 */
inline void TIM2_PWMIConfig_inline(TIM2_Channel_TypeDef TIM2_Channel,
                                   TIM2_ICPolarity_TypeDef TIM2_ICPolarity,
                                   TIM2_ICSelection_TypeDef TIM2_ICSelection,
                                   TIM2_ICPSC_TypeDef TIM2_ICPrescaler,
                                   uint8_t TIM2_ICFilter) {
  uint8_t icpolarity = (uint8_t)TIM2_ICPOLARITY_RISING;
  uint8_t icselection = (uint8_t)TIM2_ICSELECTION_DIRECTTI;

  /* Check the parameters */
  assert_param(IS_TIM2_PWMI_CHANNEL_OK(TIM2_Channel));
  assert_param(IS_TIM2_IC_POLARITY_OK(TIM2_ICPolarity));
  assert_param(IS_TIM2_IC_SELECTION_OK(TIM2_ICSelection));
  assert_param(IS_TIM2_IC_PRESCALER_OK(TIM2_ICPrescaler));

  /* Select the Opposite Input Polarity */
  if (TIM2_ICPolarity != TIM2_ICPOLARITY_FALLING) {
    icpolarity = (uint8_t)TIM2_ICPOLARITY_FALLING;
  } else {
    icpolarity = (uint8_t)TIM2_ICPOLARITY_RISING;
  }

  /* Select the Opposite Input */
  if (TIM2_ICSelection == TIM2_ICSELECTION_DIRECTTI) {
    icselection = (uint8_t)TIM2_ICSELECTION_INDIRECTTI;
  } else {
    icselection = (uint8_t)TIM2_ICSELECTION_DIRECTTI;
  }

  if (TIM2_Channel == TIM2_CHANNEL_1) {
    /* TI1 Configuration */
    TIM2_TI1_Config_inline((uint8_t)TIM2_ICPolarity, (uint8_t)TIM2_ICSelection,
                           (uint8_t)TIM2_ICFilter);

    /* Set the Input Capture Prescaler value */
    TIM2_SetIC1Prescaler_inline(TIM2_ICPrescaler);

    /* TI2 Configuration */
    TIM2_TI2_Config_inline(icpolarity, icselection, TIM2_ICFilter);

    /* Set the Input Capture Prescaler value */
    TIM2_SetIC2Prescaler_inline(TIM2_ICPrescaler);
  } else {
    /* TI2 Configuration */
    TIM2_TI2_Config_inline((uint8_t)TIM2_ICPolarity, (uint8_t)TIM2_ICSelection,
                           (uint8_t)TIM2_ICFilter);

    /* Set the Input Capture Prescaler value */
    TIM2_SetIC2Prescaler_inline(TIM2_ICPrescaler);

    /* TI1 Configuration */
    TIM2_TI1_Config_inline((uint8_t)icpolarity, icselection,
                           (uint8_t)TIM2_ICFilter);

    /* Set the Input Capture Prescaler value */
    TIM2_SetIC1Prescaler_inline(TIM2_ICPrescaler);
  }
}

/**
 * @brief  Enables or disables the TIM2 peripheral.
 * @param   NewState new state of the TIM2 peripheral. This parameter can
 * be ENABLE or DISABLE.
 * @retval None
 */
inline void TIM2_Cmd_inline(FunctionalState NewState) {
  /* Check the parameters */
  assert_param(IS_FUNCTIONALSTATE_OK(NewState));

  /* set or Reset the CEN Bit */
  if (NewState != DISABLE) {
    TIM2->CR1 |= (uint8_t)TIM2_CR1_CEN;
  } else {
    TIM2->CR1 &= (uint8_t)(~TIM2_CR1_CEN);
  }
}

/**
 * @brief  Enables or disables the specified TIM2 interrupts.
 * @param   NewState new state of the TIM2 peripheral.
 * This parameter can be: ENABLE or DISABLE.
 * @param   TIM2_IT specifies the TIM2 interrupts sources to be enabled or
 * disabled. This parameter can be any combination of the following values:
 *                       - TIM2_IT_UPDATE: TIM2 update Interrupt source
 *                       - TIM2_IT_CC1: TIM2 Capture Compare 1 Interrupt source
 *                       - TIM2_IT_CC2: TIM2 Capture Compare 2 Interrupt source
 *                       - TIM2_IT_CC3: TIM2 Capture Compare 3 Interrupt source
 * @param   NewState new state of the TIM2 peripheral.
 * @retval None
 */
inline void TIM2_ITConfig_inline(TIM2_IT_TypeDef TIM2_IT,
                                 FunctionalState NewState) {
  /* Check the parameters */
  assert_param(IS_TIM2_IT_OK(TIM2_IT));
  assert_param(IS_FUNCTIONALSTATE_OK(NewState));

