2rtfm/stm8s103-sdcc-xmake/lib/spl_split/inc/inline/stm8s_tim2_inline.h
  if (NewState != DISABLE) {
    /* Enable the Interrupt sources */
    TIM2->IER |= (uint8_t)TIM2_IT;
  } else {
    /* Disable the Interrupt sources */
    TIM2->IER &= (uint8_t)(~TIM2_IT);
  }
}

/**
 * @brief  Enables or Disables the TIM2 Update event.
 * @param   NewState new state of the TIM2 peripheral Preload register. This
 * parameter can be ENABLE or DISABLE.
 * @retval None
 */
inline void TIM2_UpdateDisableConfig_inline(FunctionalState NewState) {
  /* Check the parameters */
  assert_param(IS_FUNCTIONALSTATE_OK(NewState));

  /* Set or Reset the UDIS Bit */
  if (NewState != DISABLE) {
    TIM2->CR1 |= (uint8_t)TIM2_CR1_UDIS;
  } else {
    TIM2->CR1 &= (uint8_t)(~TIM2_CR1_UDIS);
  }
}

/**
 * @brief  Selects the TIM2 Update Request Interrupt source.
 * @param   TIM2_UpdateSource specifies the Update source.
 * This parameter can be one of the following values
 *                       - TIM2_UPDATESOURCE_REGULAR
 *                       - TIM2_UPDATESOURCE_GLOBAL
 * @retval None
 */
inline void
TIM2_UpdateRequestConfig_inline(TIM2_UpdateSource_TypeDef TIM2_UpdateSource) {
  /* Check the parameters */
  assert_param(IS_TIM2_UPDATE_SOURCE_OK(TIM2_UpdateSource));

  /* Set or Reset the URS Bit */
  if (TIM2_UpdateSource != TIM2_UPDATESOURCE_GLOBAL) {
    TIM2->CR1 |= (uint8_t)TIM2_CR1_URS;
  } else {
    TIM2->CR1 &= (uint8_t)(~TIM2_CR1_URS);
  }
}

/**
 * @brief  Selects the TIM2’s One Pulse Mode.
 * @param   TIM2_OPMode specifies the OPM Mode to be used.
 * This parameter can be one of the following values
 *                    - TIM2_OPMODE_SINGLE
 *                    - TIM2_OPMODE_REPETITIVE
 * @retval None
 */
inline void TIM2_SelectOnePulseMode_inline(TIM2_OPMode_TypeDef TIM2_OPMode) {
  /* Check the parameters */
  assert_param(IS_TIM2_OPM_MODE_OK(TIM2_OPMode));

  /* Set or Reset the OPM Bit */
  if (TIM2_OPMode != TIM2_OPMODE_REPETITIVE) {
    TIM2->CR1 |= (uint8_t)TIM2_CR1_OPM;
  } else {
    TIM2->CR1 &= (uint8_t)(~TIM2_CR1_OPM);
  }
}

/**
 * @brief  Configures the TIM2 Prescaler.
 * @param   Prescaler specifies the Prescaler Register value
 * This parameter can be one of the following values
 *                       -  TIM2_PRESCALER_1
 *                       -  TIM2_PRESCALER_2
 *                       -  TIM2_PRESCALER_4
 *                       -  TIM2_PRESCALER_8
 *                       -  TIM2_PRESCALER_16
 *                       -  TIM2_PRESCALER_32
 *                       -  TIM2_PRESCALER_64
 *                       -  TIM2_PRESCALER_128
 *                       -  TIM2_PRESCALER_256
 *                       -  TIM2_PRESCALER_512
 *                       -  TIM2_PRESCALER_1024
 *                       -  TIM2_PRESCALER_2048
 *                       -  TIM2_PRESCALER_4096
 *                       -  TIM2_PRESCALER_8192
 *                       -  TIM2_PRESCALER_16384
 *                       -  TIM2_PRESCALER_32768
 * @param   TIM2_PSCReloadMode specifies the TIM2 Prescaler Reload mode.
 * This parameter can be one of the following values
 *                       - TIM2_PSCRELOADMODE_IMMEDIATE: The Prescaler is loaded
 *                         immediately.
 *                       - TIM2_PSCRELOADMODE_UPDATE: The Prescaler is loaded at
 *                         the update event.
 * @retval None
 */
inline void
TIM2_PrescalerConfig_inline(TIM2_Prescaler_TypeDef Prescaler,
                            TIM2_PSCReloadMode_TypeDef TIM2_PSCReloadMode) {
  /* Check the parameters */
  assert_param(IS_TIM2_PRESCALER_RELOAD_OK(TIM2_PSCReloadMode));
  assert_param(IS_TIM2_PRESCALER_OK(Prescaler));

  /* Set the Prescaler value */
  TIM2->PSCR = (uint8_t)Prescaler;

  /* Set or reset the UG Bit */
  TIM2->EGR = (uint8_t)TIM2_PSCReloadMode;
}

/**
 * @brief  Forces the TIM2 Channel1 output waveform to active or inactive level.
 * @param   TIM2_ForcedAction specifies the forced Action to be set to the
 * output waveform. This parameter can be one of the following values:
 *                       - TIM2_FORCEDACTION_ACTIVE: Force active level on
 * OC1REF
 *                       - TIM2_FORCEDACTION_INACTIVE: Force inactive level on
 *                         OC1REF.
 * @retval None
 */
inline void
TIM2_ForcedOC1Config_inline(TIM2_ForcedAction_TypeDef TIM2_ForcedAction) {
  /* Check the parameters */
  assert_param(IS_TIM2_FORCED_ACTION_OK(TIM2_ForcedAction));

  /* Reset the OCM Bits & Configure the Forced output Mode */
  TIM2->CCMR1 = (uint8_t)((uint8_t)(TIM2->CCMR1 & (uint8_t)(~TIM2_CCMR_OCM)) |
                          (uint8_t)TIM2_ForcedAction);
}

/**
 * @brief  Forces the TIM2 Channel2 output waveform to active or inactive level.
 * @param   TIM2_ForcedAction specifies the forced Action to be set to the
 * output waveform. This parameter can be one of the following values:
 *                       - TIM2_FORCEDACTION_ACTIVE: Force active level on
 * OC2REF
 *                       - TIM2_FORCEDACTION_INACTIVE: Force inactive level on
 *                         OC2REF.
 * @retval None
 */
inline void
TIM2_ForcedOC2Config_inline(TIM2_ForcedAction_TypeDef TIM2_ForcedAction) {
  /* Check the parameters */
  assert_param(IS_TIM2_FORCED_ACTION_OK(TIM2_ForcedAction));

  /* Reset the OCM Bits & Configure the Forced output Mode */
  TIM2->CCMR2 = (uint8_t)((uint8_t)(TIM2->CCMR2 & (uint8_t)(~TIM2_CCMR_OCM)) |
                          (uint8_t)TIM2_ForcedAction);
}

/**
 * @brief  Forces the TIM2 Channel3 output waveform to active or inactive level.
 * @param   TIM2_ForcedAction specifies the forced Action to be set to the
 * output waveform. This parameter can be one of the following values:
 *                       - TIM2_FORCEDACTION_ACTIVE: Force active level on
 * OC3REF
 *                       - TIM2_FORCEDACTION_INACTIVE: Force inactive level on
 *                         OC3REF.
 * @retval None
 */
inline void
TIM2_ForcedOC3Config_inline(TIM2_ForcedAction_TypeDef TIM2_ForcedAction) {
  /* Check the parameters */
  assert_param(IS_TIM2_FORCED_ACTION_OK(TIM2_ForcedAction));

  /* Reset the OCM Bits & Configure the Forced output Mode */
  TIM2->CCMR3 = (uint8_t)((uint8_t)(TIM2->CCMR3 & (uint8_t)(~TIM2_CCMR_OCM)) |
                          (uint8_t)TIM2_ForcedAction);
}

/**
 * @brief  Enables or disables TIM2 peripheral Preload register on ARR.
 * @param   NewState new state of the TIM2 peripheral Preload register.
 * This parameter can be ENABLE or DISABLE.
 * @retval None
 */
inline void TIM2_ARRPreloadConfig_inline(FunctionalState NewState) {
  /* Check the parameters */
  assert_param(IS_FUNCTIONALSTATE_OK(NewState));

  /* Set or Reset the ARPE Bit */
  if (NewState != DISABLE) {
    TIM2->CR1 |= (uint8_t)TIM2_CR1_ARPE;
  } else {
    TIM2->CR1 &= (uint8_t)(~TIM2_CR1_ARPE);
  }
}

/**
 * @brief  Enables or disables the TIM2 peripheral Preload Register on CCR1.
 * @param   NewState new state of the Capture Compare Preload register.
 * This parameter can be ENABLE or DISABLE.
 * @retval None
 */
inline void TIM2_OC1PreloadConfig_inline(FunctionalState NewState) {
  /* Check the parameters */
  assert_param(IS_FUNCTIONALSTATE_OK(NewState));

  /* Set or Reset the OC1PE Bit */
  if (NewState != DISABLE) {
    TIM2->CCMR1 |= (uint8_t)TIM2_CCMR_OCxPE;
  } else {
    TIM2->CCMR1 &= (uint8_t)(~TIM2_CCMR_OCxPE);
  }
}

/**
 * @brief  Enables or disables the TIM2 peripheral Preload Register on CCR2.
 * @param   NewState new state of the Capture Compare Preload register.
 * This parameter can be ENABLE or DISABLE.
 * @retval None
 */
inline void TIM2_OC2PreloadConfig_inline(FunctionalState NewState) {
  /* Check the parameters */
  assert_param(IS_FUNCTIONALSTATE_OK(NewState));

  /* Set or Reset the OC2PE Bit */
  if (NewState != DISABLE) {
    TIM2->CCMR2 |= (uint8_t)TIM2_CCMR_OCxPE;
  } else {
    TIM2->CCMR2 &= (uint8_t)(~TIM2_CCMR_OCxPE);
  }
}

/**
 * @brief  Enables or disables the TIM2 peripheral Preload Register on CCR3.
 * @param   NewState new state of the Capture Compare Preload register.
 * This parameter can be ENABLE or DISABLE.
 * @retval None
 */
inline void TIM2_OC3PreloadConfig_inline(FunctionalState NewState) {
  /* Check the parameters */
  assert_param(IS_FUNCTIONALSTATE_OK(NewState));

