2rtfm/stm8s103-sdcc-xmake/lib/spl_split/inc/inline/stm8s_tim2_inline.h
    /* Reset the Output Compare Bits & Set the Output Compare Mode */
    TIM2->CCMR2 = (uint8_t)((uint8_t)(TIM2->CCMR2 & (uint8_t)(~TIM2_CCMR_OCM)) |
                            (uint8_t)TIM2_OCMode);
  } else {
    /* Disable the Channel 3: Reset the CCE Bit */
    TIM2->CCER2 &= (uint8_t)(~TIM2_CCER2_CC3E);

    /* Reset the Output Compare Bits & Set the Output Compare Mode */
    TIM2->CCMR3 = (uint8_t)((uint8_t)(TIM2->CCMR3 & (uint8_t)(~TIM2_CCMR_OCM)) |
                            (uint8_t)TIM2_OCMode);
  }
}

/**
 * @brief  Sets the TIM2 Counter Register value.
 * @param   Counter specifies the Counter register new value.
 * This parameter is between 0x0000 and 0xFFFF.
 * @retval None
 */
inline void TIM2_SetCounter_inline(uint16_t Counter) {
  /* Set the Counter Register value */
  TIM2->CNTRH = (uint8_t)(Counter >> 8);
  TIM2->CNTRL = (uint8_t)(Counter);
}

/**
 * @brief  Sets the TIM2 Autoreload Register value.
 * @param   Autoreload specifies the Autoreload register new value.
 * This parameter is between 0x0000 and 0xFFFF.
 * @retval None
 */
inline void TIM2_SetAutoreload_inline(uint16_t Autoreload) {
  /* Set the Autoreload Register value */
  TIM2->ARRH = (uint8_t)(Autoreload >> 8);
  TIM2->ARRL = (uint8_t)(Autoreload);
}

/**
 * @brief  Sets the TIM2 Capture Compare1 Register value.
 * @param   Compare1 specifies the Capture Compare1 register new value.
 * This parameter is between 0x0000 and 0xFFFF.
 * @retval None
 */
inline void TIM2_SetCompare1_inline(uint16_t Compare1) {
  /* Set the Capture Compare1 Register value */
  TIM2->CCR1H = (uint8_t)(Compare1 >> 8);
  TIM2->CCR1L = (uint8_t)(Compare1);
}

/**
 * @brief  Sets the TIM2 Capture Compare2 Register value.
 * @param   Compare2 specifies the Capture Compare2 register new value.
 * This parameter is between 0x0000 and 0xFFFF.
 * @retval None
 */
inline void TIM2_SetCompare2_inline(uint16_t Compare2) {
  /* Set the Capture Compare2 Register value */
  TIM2->CCR2H = (uint8_t)(Compare2 >> 8);
  TIM2->CCR2L = (uint8_t)(Compare2);
}

/**
 * @brief  Sets the TIM2 Capture Compare3 Register value.
 * @param   Compare3 specifies the Capture Compare3 register new value.
 * This parameter is between 0x0000 and 0xFFFF.
 * @retval None
 */
inline void TIM2_SetCompare3_inline(uint16_t Compare3) {
  /* Set the Capture Compare3 Register value */
  TIM2->CCR3H = (uint8_t)(Compare3 >> 8);
  TIM2->CCR3L = (uint8_t)(Compare3);
}

/**
 * @brief  Sets the TIM2 Input Capture 1 Prescaler.
 * @param   TIM2_IC1Prescaler specifies the Input Capture prescaler new value
 * This parameter can be one of the following values:
 *                       - TIM2_ICPSC_DIV1: no prescaler
 *                       - TIM2_ICPSC_DIV2: capture is done once every 2 events
 *                       - TIM2_ICPSC_DIV4: capture is done once every 4 events
 *                       - TIM2_ICPSC_DIV8: capture is done once every 8 events
 * @retval None
 */
inline void TIM2_SetIC1Prescaler_inline(TIM2_ICPSC_TypeDef TIM2_IC1Prescaler) {
  /* Check the parameters */
  assert_param(IS_TIM2_IC_PRESCALER_OK(TIM2_IC1Prescaler));

  /* Reset the IC1PSC Bits &Set the IC1PSC value */
  TIM2->CCMR1 =
      (uint8_t)((uint8_t)(TIM2->CCMR1 & (uint8_t)(~TIM2_CCMR_ICxPSC)) |
                (uint8_t)TIM2_IC1Prescaler);
}

/**
 * @brief  Sets the TIM2 Input Capture 2 prescaler.
 * @param   TIM2_IC2Prescaler specifies the Input Capture prescaler new value
 * This parameter can be one of the following values:
 *                       - TIM2_ICPSC_DIV1: no prescaler
 *                       - TIM2_ICPSC_DIV2: capture is done once every 2 events
 *                       - TIM2_ICPSC_DIV4: capture is done once every 4 events
 *                       - TIM2_ICPSC_DIV8: capture is done once every 8 events
 * @retval None
 */
inline void TIM2_SetIC2Prescaler_inline(TIM2_ICPSC_TypeDef TIM2_IC2Prescaler) {
  /* Check the parameters */
  assert_param(IS_TIM2_IC_PRESCALER_OK(TIM2_IC2Prescaler));

  /* Reset the IC1PSC Bits &Set the IC1PSC value */
  TIM2->CCMR2 =
      (uint8_t)((uint8_t)(TIM2->CCMR2 & (uint8_t)(~TIM2_CCMR_ICxPSC)) |
                (uint8_t)TIM2_IC2Prescaler);
}

/**
 * @brief  Sets the TIM2 Input Capture 3 prescaler.
 * @param   TIM2_IC3Prescaler specifies the Input Capture prescaler new value
 * This parameter can be one of the following values:
 *                       - TIM2_ICPSC_DIV1: no prescaler
 *                       - TIM2_ICPSC_DIV2: capture is done once every 2 events
 *                       - TIM2_ICPSC_DIV4: capture is done once every 4 events
 *                       - TIM2_ICPSC_DIV8: capture is done once every 8 events
 * @retval None
 */
inline void TIM2_SetIC3Prescaler_inline(TIM2_ICPSC_TypeDef TIM2_IC3Prescaler) {

  /* Check the parameters */
  assert_param(IS_TIM2_IC_PRESCALER_OK(TIM2_IC3Prescaler));
  /* Reset the IC1PSC Bits &Set the IC1PSC value */
  TIM2->CCMR3 =
      (uint8_t)((uint8_t)(TIM2->CCMR3 & (uint8_t)(~TIM2_CCMR_ICxPSC)) |
                (uint8_t)TIM2_IC3Prescaler);
}

/**
 * @brief  Gets the TIM2 Input Capture 1 value.
 * @param  None
 * @retval Capture Compare 1 Register value.
 */
inline uint16_t TIM2_GetCapture1_inline(void) {
  /* Get the Capture 1 Register value */
  uint16_t tmpccr1 = 0;
  uint8_t tmpccr1l = 0, tmpccr1h = 0;

  tmpccr1h = TIM2->CCR1H;
  tmpccr1l = TIM2->CCR1L;

  tmpccr1 = (uint16_t)(tmpccr1l);
  tmpccr1 |= (uint16_t)((uint16_t)tmpccr1h << 8);
  /* Get the Capture 1 Register value */
  return (uint16_t)tmpccr1;
}

/**
 * @brief  Gets the TIM2 Input Capture 2 value.
 * @param  None
 * @retval Capture Compare 2 Register value.
 */
inline uint16_t TIM2_GetCapture2_inline(void) {
  /* Get the Capture 2 Register value */
  uint16_t tmpccr2 = 0;
  uint8_t tmpccr2l = 0, tmpccr2h = 0;

  tmpccr2h = TIM2->CCR2H;
  tmpccr2l = TIM2->CCR2L;

  tmpccr2 = (uint16_t)(tmpccr2l);
  tmpccr2 |= (uint16_t)((uint16_t)tmpccr2h << 8);
  /* Get the Capture 2 Register value */
  return (uint16_t)tmpccr2;
}

/**
 * @brief  Gets the TIM2 Input Capture 3 value.
 * @param  None
 * @retval Capture Compare 3 Register value.
 */
inline uint16_t TIM2_GetCapture3_inline(void) {
  /* Get the Capture 3 Register value */
  uint16_t tmpccr3 = 0;
  uint8_t tmpccr3l = 0, tmpccr3h = 0;

  tmpccr3h = TIM2->CCR3H;
  tmpccr3l = TIM2->CCR3L;

  tmpccr3 = (uint16_t)(tmpccr3l);
  tmpccr3 |= (uint16_t)((uint16_t)tmpccr3h << 8);
  /* Get the Capture 3 Register value */
  return (uint16_t)tmpccr3;
}

/**
 * @brief  Gets the TIM2 Counter value.
 * @param  None
 * @retval Counter Register value.
 */
inline uint16_t TIM2_GetCounter_inline(void) {
  uint16_t tmpcntr = 0;

  tmpcntr = ((uint16_t)TIM2->CNTRH << 8);
  /* Get the Counter Register value */
  return (uint16_t)(tmpcntr | (uint16_t)(TIM2->CNTRL));
}

/**
 * @brief  Gets the TIM2 Prescaler value.
 * @param  None
 * @retval Prescaler Register configuration value  @ref TIM2_Prescaler_TypeDef.
 */
inline TIM2_Prescaler_TypeDef TIM2_GetPrescaler_inline(void) {
  /* Get the Prescaler Register value */
  return (TIM2_Prescaler_TypeDef)(TIM2->PSCR);
}

/**
 * @brief  Checks whether the specified TIM2 flag is set or not.
 * @param   TIM2_FLAG specifies the flag to check.
 * This parameter can be one of the following values:
 *                       - TIM2_FLAG_UPDATE: TIM2 update Flag
 *                       - TIM2_FLAG_CC1: TIM2 Capture Compare 1 Flag
 *                       - TIM2_FLAG_CC2: TIM2 Capture Compare 2 Flag
 *                       - TIM2_FLAG_CC3: TIM2 Capture Compare 3 Flag
 *                       - TIM2_FLAG_CC1OF: TIM2 Capture Compare 1 over capture
 * Flag
 *                       - TIM2_FLAG_CC2OF: TIM2 Capture Compare 2 over capture
 * Flag
 *                       - TIM2_FLAG_CC3OF: TIM2 Capture Compare 3 over capture
 * Flag
 * @retval FlagStatus The new state of TIM2_FLAG (SET or RESET).
 */
inline FlagStatus TIM2_GetFlagStatus_inline(TIM2_FLAG_TypeDef TIM2_FLAG) {
  FlagStatus bitstatus = RESET;
  uint8_t tim2_flag_l = 0, tim2_flag_h = 0;

  /* Check the parameters */
  assert_param(IS_TIM2_GET_FLAG_OK(TIM2_FLAG));

  tim2_flag_l = (uint8_t)(TIM2->SR1 & (uint8_t)TIM2_FLAG);
  tim2_flag_h = (uint8_t)((uint16_t)TIM2_FLAG >> 8);

  if ((tim2_flag_l | (uint8_t)(TIM2->SR2 & tim2_flag_h)) != (uint8_t)RESET) {
    bitstatus = SET;
  } else {
    bitstatus = RESET;
  }
  return (FlagStatus)bitstatus;
}

/**
 * @brief  Clears the TIM2’s pending flags.
 * @param   TIM2_FLAG specifies the flag to clear.
 * This parameter can be one of the following values:
 *                       - TIM2_FLAG_UPDATE: TIM2 update Flag
 *                       - TIM2_FLAG_CC1: TIM2 Capture Compare 1 Flag
 *                       - TIM2_FLAG_CC2: TIM2 Capture Compare 2 Flag
 *                       - TIM2_FLAG_CC3: TIM2 Capture Compare 3 Flag
 *                       - TIM2_FLAG_CC1OF: TIM2 Capture Compare 1 over capture
 * Flag
 *                       - TIM2_FLAG_CC2OF: TIM2 Capture Compare 2 over capture
 * Flag
 *                       - TIM2_FLAG_CC3OF: TIM2 Capture Compare 3 over capture
 * Flag
 * @retval None.
 */
inline void TIM2_ClearFlag_inline(TIM2_FLAG_TypeDef TIM2_FLAG) {
  /* Check the parameters */
  assert_param(IS_TIM2_CLEAR_FLAG_OK(TIM2_FLAG));

  /* Clear the flags (rc_w0) clear this bit by writing 0. Writing ‘1’ has no
   * effect*/
  TIM2->SR1 = (uint8_t)(~((uint8_t)(TIM2_FLAG)));
  TIM2->SR2 = (uint8_t)(~((uint8_t)((uint8_t)TIM2_FLAG >> 8)));
}

/**
 * @brief  Checks whether the TIM2 interrupt has occurred or not.
 * @param   TIM2_IT specifies the TIM2 interrupt source to check.
 * This parameter can be one of the following values:
 *                       - TIM2_IT_UPDATE: TIM2 update Interrupt source
 *                       - TIM2_IT_CC1: TIM2 Capture Compare 1 Interrupt source
 *                       - TIM2_IT_CC2: TIM2 Capture Compare 2 Interrupt source
 *                       - TIM2_IT_CC3: TIM2 Capture Compare 3 Interrupt source
 * @retval ITStatus The new state of the TIM2_IT(SET or RESET).
 */
inline ITStatus TIM2_GetITStatus_inline(TIM2_IT_TypeDef TIM2_IT) {
  ITStatus bitstatus = RESET;
  uint8_t TIM2_itStatus = 0, TIM2_itEnable = 0;

  /* Check the parameters */
  assert_param(IS_TIM2_GET_IT_OK(TIM2_IT));

  TIM2_itStatus = (uint8_t)(TIM2->SR1 & TIM2_IT);

