2rtfm/stm8s103-sdcc-xmake/lib/spl_split/inc/inline/stm8s_tim2_inline.h
  TIM2_itEnable = (uint8_t)(TIM2->IER & TIM2_IT);

  if ((TIM2_itStatus != (uint8_t)RESET) && (TIM2_itEnable != (uint8_t)RESET)) {
    bitstatus = SET;
  } else {
    bitstatus = RESET;
  }
  return (ITStatus)(bitstatus);
}

/**
 * @brief  Clears the TIM2's interrupt pending bits.
 * @param   TIM2_IT specifies the pending bit to clear.
 * This parameter can be one of the following values:
 *                       - TIM2_IT_UPDATE: TIM2 update Interrupt source
 *                       - TIM2_IT_CC1: TIM2 Capture Compare 1 Interrupt source
 *                       - TIM2_IT_CC2: TIM2 Capture Compare 2 Interrupt source
 *                       - TIM2_IT_CC3: TIM2 Capture Compare 3 Interrupt source
 * @retval None.
 */
inline void TIM2_ClearITPendingBit_inline(TIM2_IT_TypeDef TIM2_IT) {
  /* Check the parameters */
  assert_param(IS_TIM2_IT_OK(TIM2_IT));

  /* Clear the IT pending Bit */
  TIM2->SR1 = (uint8_t)(~TIM2_IT);
}

/**
 * @brief  Configure the TI1 as Input.
 * @param   TIM2_ICPolarity  The Input Polarity.
 * This parameter can be one of the following values:
 *                       - TIM2_ICPOLARITY_FALLING
 *                       - TIM2_ICPOLARITY_RISING
 * @param   TIM2_ICSelection specifies the input to be used.
 * This parameter can be one of the following values:
 *                       - TIM2_ICSELECTION_DIRECTTI: TIM2 Input 1 is selected
 * to be connected to IC1.
 *                       - TIM2_ICSELECTION_INDIRECTTI: TIM2 Input 1 is selected
 * to be connected to IC2.
 * @param   TIM2_ICFilter Specifies the Input Capture Filter.
 * This parameter must be a value between 0x00 and 0x0F.
 * @retval None
 */
inline void TIM2_TI1_Config_inline(uint8_t TIM2_ICPolarity,
                                   uint8_t TIM2_ICSelection,
                                   uint8_t TIM2_ICFilter) {
  /* Disable the Channel 1: Reset the CCE Bit */
  TIM2->CCER1 &= (uint8_t)(~TIM2_CCER1_CC1E);

  /* Select the Input and set the filter */
  TIM2->CCMR1 =
      (uint8_t)((uint8_t)(TIM2->CCMR1 & (uint8_t)(~(uint8_t)(TIM2_CCMR_CCxS |
                                                             TIM2_CCMR_ICxF))) |
                (uint8_t)(((TIM2_ICSelection)) |
                          ((uint8_t)(TIM2_ICFilter << 4))));

  /* Select the Polarity */
  if (TIM2_ICPolarity != TIM2_ICPOLARITY_RISING) {
    TIM2->CCER1 |= TIM2_CCER1_CC1P;
  } else {
    TIM2->CCER1 &= (uint8_t)(~TIM2_CCER1_CC1P);
  }
  /* Set the CCE Bit */
  TIM2->CCER1 |= TIM2_CCER1_CC1E;
}

/**
 * @brief  Configure the TI2 as Input.
 * @param   TIM2_ICPolarity  The Input Polarity.
 * This parameter can be one of the following values:
 *                       - TIM2_ICPOLARITY_FALLING
 *                       - TIM2_ICPOLARITY_RISING
 * @param   TIM2_ICSelection specifies the input to be used.
 * This parameter can be one of the following values:
 *                       - TIM2_ICSELECTION_DIRECTTI: TIM2 Input 2 is selected
 * to be connected to IC2.
 *                       - TIM2_ICSELECTION_INDIRECTTI: TIM2 Input 2 is selected
 * to be connected to IC1.
 * @param   TIM2_ICFilter Specifies the Input Capture Filter.
 * This parameter must be a value between 0x00 and 0x0F.
 * @retval None
 */
inline void TIM2_TI2_Config_inline(uint8_t TIM2_ICPolarity,
                                   uint8_t TIM2_ICSelection,
                                   uint8_t TIM2_ICFilter) {
  /* Disable the Channel 2: Reset the CCE Bit */
  TIM2->CCER1 &= (uint8_t)(~TIM2_CCER1_CC2E);

  /* Select the Input and set the filter */
  TIM2->CCMR2 =
      (uint8_t)((uint8_t)(TIM2->CCMR2 & (uint8_t)(~(uint8_t)(TIM2_CCMR_CCxS |
                                                             TIM2_CCMR_ICxF))) |
                (uint8_t)(((TIM2_ICSelection)) |
                          ((uint8_t)(TIM2_ICFilter << 4))));

  /* Select the Polarity */
  if (TIM2_ICPolarity != TIM2_ICPOLARITY_RISING) {
    TIM2->CCER1 |= TIM2_CCER1_CC2P;
  } else {
    TIM2->CCER1 &= (uint8_t)(~TIM2_CCER1_CC2P);
  }

  /* Set the CCE Bit */
  TIM2->CCER1 |= TIM2_CCER1_CC2E;
}

/**
 * @brief  Configure the TI3 as Input.
 * @param   TIM2_ICPolarity  The Input Polarity.
 * This parameter can be one of the following values:
 *                       - TIM2_ICPOLARITY_FALLING
 *                       - TIM2_ICPOLARITY_RISING
 * @param   TIM2_ICSelection specifies the input to be used.
 * This parameter can be one of the following values:
 *                       - TIM2_ICSELECTION_DIRECTTI: TIM2 Input 3 is selected
 * to be connected to IC3.
 * @param   TIM2_ICFilter Specifies the Input Capture Filter.
 * This parameter must be a value between 0x00 and 0x0F.
 * @retval None
 */
inline void TIM2_TI3_Config_inline(uint8_t TIM2_ICPolarity,
                                   uint8_t TIM2_ICSelection,
                                   uint8_t TIM2_ICFilter) {
  /* Disable the Channel 3: Reset the CCE Bit */
  TIM2->CCER2 &= (uint8_t)(~TIM2_CCER2_CC3E);

  /* Select the Input and set the filter */
  TIM2->CCMR3 =
      (uint8_t)((uint8_t)(TIM2->CCMR3 &
                          (uint8_t)(~(TIM2_CCMR_CCxS | TIM2_CCMR_ICxF))) |
                (uint8_t)(((TIM2_ICSelection)) |
                          ((uint8_t)(TIM2_ICFilter << 4))));

  /* Select the Polarity */
  if (TIM2_ICPolarity != TIM2_ICPOLARITY_RISING) {
    TIM2->CCER2 |= TIM2_CCER2_CC3P;
  } else {
    TIM2->CCER2 &= (uint8_t)(~TIM2_CCER2_CC3P);
  }
  /* Set the CCE Bit */
  TIM2->CCER2 |= TIM2_CCER2_CC3E;
}

#endif
